{
  "title": "TIL THERE'S NO WIND",
  "year": "2021-2025",
  "description": [
    "Three years before I took the first photo of this series, T and I had become friends in an international high school. Halfway through his studies, T had to take an academic leave. In winter 2021, I visited his home in New Mexico for the first time. After spending Christmas together, I planned road trip for us to visit someone we both knew from high school. Things went unexpectedly as I had kept T’s arrival a secret.",

    "This story is about leaving and being left behind in the vast landscapes of the American Southwest. The photographed subjects are in a constant state of arrival, yet in the very moment that they are captured, there is a seed of departure. This duality–of coming and leaving–can be abrupt and escapes the understanding of its participant, with reverberations only to be felt in the future tense.",

    "Due to the fleeting nature of encounters in this journey, I sensed in many subjects--including myself--a desire to seek stillness among ever-changing conditions. This desire, which too often fell short of itself, is perfectly captured in a remark that T once made: 'I don’t mind the cold as long as it’s not windy. I don’t mind the clouds as long as it’s not windy. I don’t mind the snow as long as it’s not windy.'"
  ],
  "captions": [
    "T’s section-8 one-bedroom apartment. Living room.",
    "C, T’s childhood friend, had been staying with T after a family argument. He was the only one in the house old enough to buy alcohol. In 3 weeks, C and T will get into a big fight.",
    "S talking about his direct experience with God after taking psychedelics. He was hitchhiking from Kentucky to California and back when T’s father picked him up in Albuquerque. His friends nicknamed him “Messi”, short for “Messiah”.",
    "T’s recently adopted cat. He named it “Muc”, meaning ink in Vietnamese. One year later, Muc would run away and couldn’t be found.",
    "T playing his guitar. He refused to go on the road trip without it.",
    "T’s 2001 manual Nissan, a pass-down from his dad. In 2 years, this Nissan would lose a race against a Chevy Camaro before being towed by the police. It has not been recovered since.",
    "Messi in a natural hot spring tub. 2 years ago, his girlfriend'd just had a baby before they met.",
    "T cooling off from a dip. Moments later, a passerby shouted You’re not supposed to be naked. T goes to the hot spring when he feels low.",
    "T on his dad: 'He would go out for a pack of cigarettes and be gone for a year.'",
    "T and his dad after checking on the Nissan. It was deemed unfit for the upcoming trip.",
    "T's friend C offered him his car. It was a manual Subaru WRX that C had saved up for over many years.",
    "T took the Subaru to a mechanic who was a friend of his dad. It was in dire need of fresh tires and an oil change.",
    "The mechanic lived on a ranch with a pack of dogs. There, T met and adopted a pitbull. It's been named been named “Fat Boy” by its previous owner, who recently got sentenced to jail.",
    "T was ready to start the trip.",
    "'It’s time to go home', Messi said. None of us have heard from him since.",
    "A cemetery on the outskirts of T’s hometown.",
    "By sunset, the car made it to Taos. Its battery died and there wouldn’t be help until the next morning.",
    "Entering Colorado. I saw snow for the first time.",
    "T walking Fat Boy outside of a gas station.",
    "Entering Utah. The camera got jammed.",
    "Waiting out a storm in Salt Lake City.",
    "Fat Boy standing before a frozen lake, Nevada.",
    "Setting up camp.",
    "Entering the Sierra Nevada.",
    "Fat Boy running on a backroad. In 12 hours, the car battery will die again.",
    "A retired LAPD officer jumped the car. A year ago, his pitbull died and was buried nearby. “I got a gun”, he warned when T first approached. He let his guard down after seeing Fat Boy.",
    "Fat Boy taking a nap. In 6 months, he’d have a new owner.",
    "Deep Springs Valley, California. The destination.",
    "K, who we'd driven all the way to meet, took us to a natural hot spring.",
    "T’s arrival came as a big surprise to K. They used to live in the same dorm in high school.",
    "T had a reputation.",
    "The following day, we went on a day trip.",
    "Death Valley, California.",
    "An argument broke out. T decided to leave.",
    "We bid farewell. In a week, T’d be locked outside of the Subaru on his way home. He’d have to break the window to get in.",
    "K standing on the dumpsite of his college. Less than 20 students were enrolled at any given point.",
    "K and I got Covid and was quarantined in a spare cottage. Ten minutes earlier, someone had left a half-empty bottle of whiskey on the porch.",
    "K was a Czech photojournalist who’d recently returned from Ukraine. Out of boredom, he suggested going on a hike.",
    "The Druid, Deep Springs Valley, California.",
    "K overlooking the Deep Springs valley. In less than a year, K would drop out and go to Ukraine again.",
    "K took a shot with my camera. Two years later, the frame would be developed in a public bathroom at a college on the East coast.",
    "End of roll."
  ]
}
