{
  "title": "WEDDING IN LOLO VILLAGE",
  "year": "2020",
  "description": [
    "I met Th the summer of 2020 while visiting Lung Cu, Ha Giang, the northernmost commune of Vietnam. He’d just finished military service and returned to his village, home to a big population of the Vietnamese Lolo ethnic group. He introduced me to his family and L, his then fianceé. After drinking lots of homemade corn wine, I received an invitation to their wedding in October.",
    "Th and L had already had their engagement photo taken by a studio when I arrived. With days to spare, I wanted to offer a mundane perspective into the scenes behind their big ceremony–gatherings in the house, actions in the yard, and sometimes objects displayed on the wall. There was no catering services, which I think was only possible because everyone didn’t hesitate to roll up their sleeves. With only a thousand people in Lolo village, this was undoubtedly the spirit that bonded families and doubled enjoyments in both moments of labor and rest.",
    "Th and L are still living in Lolo village and recently had their second child together."
  ],
  "captions": [
    "Three days before the wedding. A photo of Th and L.",
    "Th writing invitation cards with his dad.",
    "Th’s dad making dinner.",
    "Th serving homemade corn wine to his mom.",
    "Th’s dad smoking ‘thuoc lao’ from a bamboo bong",
    "Two days before the wedding. Th’s mom standing in front of their house.",
    "Sports medals, certificates for outstanding achievements, and an embroidery hanging on the wall of Th’s house.",
    "Free-range chickens.",
    "Neighbors helping Th’s family set up a tent.",
    "Wifi router, karaoke setup, and a portrait of Ho Chi Minh on the wall of L’s house.",
    "Boiled chicken and chicken blood, two staple dishes in Vietnamese gatherings",
    "Th’s bachelors party.",
    "One day before the wedding. Two men setting up a tent.",
    "A pig being sacrificed. Th’s father-in-law standing to his right.",
    "L’s mom cooking.",
    "A boy making hot lemonade (left), a man stirring a pot of pork (right).",
    "Tables being prepared for the pre-wedding ceremony.",
    "Th’s sister putting on a traditional Lolo dress.",
    "A table for women elders.",
    "Tables for men.",
    "Th having a toast with each table.",
    "A child tugging on a dress.",
    "A woman eating watermelon.",
    "Offerings being brought from the groom's to the bride's family. The flagpole in the distance marks the northernmost point of Vietnam.",
    "Day of the wedding. A photo of Th and his family.",
    "L getting dressed. Together with Th, they will be greeting over a thousand guests.",
    "Guests being greeted by both family as they arrive.",
    "Three days before the wedding. L and Th at a dinner table."
  ]
}
